In [1]:
from db_connection import run_query, fetch_dataframe

In [2]:
run_query("albums", "SHOW TABLES;")

[('albums',), ('artists',), ('genre',), ('record_labels',)]

In [3]:
# To load data in pandas DataFrame
df = fetch_dataframe("employees", "SELECT * FROM employees LIMIT 10;")
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [2]:
run_query("employees", 'SHOW TABLES')

[('departments',),
 ('dept_emp',),
 ('dept_manager',),
 ('employees',),
 ('salaries',),
 ('titles',),
 ('w_dept_emp_latest_date',)]